; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared2 - mode
	spectrograph0 - mode
	image6 - mode
	image5 - mode
	thermograph4 - mode
	spectrograph3 - mode
	infrared1 - mode
	Star5 - direction
	GroundStation3 - direction
	Star1 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image5)
	(calibration_target instrument0 Star0)
	(supports instrument1 image6)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument3 spectrograph3)
	(supports instrument3 infrared1)
	(supports instrument3 image5)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star0)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
)
(:goal (and
	(pointing satellite2 Planet10)
	(have_image Star6 image5)
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 spectrograph3)
	(have_image Phenomenon9 infrared2)
	(have_image Planet10 image5)
	(have_image Planet11 infrared2)
))

)

; plan
1. (turn_to satellite2 groundstation2 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 7
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite2 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite2 star8 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star8)
   goals met: 0 of 7
5. (take_image satellite2 star8 instrument3 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 1 of 7
6. (turn_to satellite2 star6 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star6)
   goals met: 1 of 7
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 7
8. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 1 of 7
9. (take_image satellite2 star6 instrument3 image5)
   added: (have_image star6 image5)
   goals met: 2 of 7
10. (turn_to satellite0 phenomenon7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 7
11. (take_image satellite0 phenomenon7 instrument1 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 3 of 7
12. (turn_to satellite0 phenomenon9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 7
13. (take_image satellite0 phenomenon9 instrument1 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 4 of 7
14. (turn_to satellite0 planet11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet11)
   goals met: 4 of 7
15. (take_image satellite0 planet11 instrument1 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 5 of 7
16. (turn_to satellite2 planet10 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 planet10)
   goals met: 6 of 7
17. (take_image satellite2 planet10 instrument3 image5)
   added: (have_image planet10 image5)
   goals met: 7 of 7
